homework/Lab04/combustorRhoPimple_highT_highRe/0/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(splitter|back)"
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            fixedValue;
        value           uniform 700.0;
    }

    sides
    {
        type            fixedValue;
        value           uniform 1500.0;
    }

    frontAndBack
    {
        type            empty;
    }
}

